---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AssociatedLevelOffset
source: html/c284956f-f364-c9ef-f095-ecf40450b545.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AssociatedLevelOffset Property

"Associated Level Offset": The offset from the associated level.

## Syntax (C#)
```csharp
public static ForgeTypeId AssociatedLevelOffset { get; }
```